app/controllers/microposts_controller.rb

  def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save
---
INSERT INTO "microposts" ("content", "picture", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "Da Fuck!"], ["picture", "co-flag.jpg"], ["user_id", 1], ["created_at", "2015-01-18 15:02:32.399991"], ["updated_at", "2015-01-18 15:02:32.399991"]]