app/controllers/start_pages_controller.rb

SELECT  "microposts".* FROM "microposts" WHERE (user_id IN (SELECT followed_id FROM relationships WHERE follower_id = 1) OR user_id = 1)  ORDER BY "microposts"."created_at" DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE (user_id IN (SELECT followed_id FROM relationships WHERE follower_id = 1) OR user_id = 1)
---
  def home
    @micropost = current_user.microposts.build if logged_in?
    #Becaus feed method has class Micropost(Micropost.where()..), rails looks for _micropost.html.erb partial
    if current_user
      @feed_items = current_user.feed.paginate(page: params[:page])