app/controllers/users_controller.rb

SELECT  "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
    # first run-> @users = User.all
    @users = User.paginate(page: params[:page])

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "activation_digest") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    #@user = User.new(params[:user]) - FIRST ROUND
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "name" = ?, "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Foo Bar"], ["email", "foo@bar.com"], ["password_digest", "$2a$04$Hx96ALc8agnycpp6a7iM/OIzUQgeCWyF3s0XtMudJ75cJyiZntWQ6"], ["updated_at", "2015-01-08 01:05:19.277902"], ["id", 380377255]]
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)